# Monitor security logs by using Azure Monitor

## Important Azure Monitor Tables

[Azure Monitor Logs table reference #Security](https://docs.microsoft.com/en-us/azure/azure-monitor/reference/tables/tables-category#security)

* SecurityEvent - Security events collected from windows machines by Azure Security Center or Azure Sentinel (failed logins, ... )
* SecurityAlert - Alerts that been generated by security products (virus detected, ... )

(I wish there was a reference that told me which tables I should monitor!)

## Kusto Query Language (KQL)

[Get started with log queries in Azure Monitor](https://docs.microsoft.com/en-us/azure/azure-monitor/logs/get-started-queries)

Operations:
* _project_ is similar to _select_ in sql (Choose which columns to display). Example: SecurityEvent | project Computer, TimeGenerated
* _extend_ adds an extra, computed column. Example: SecurityEvent | extend EventCode=substring(Activity, 0, 4)
* _summarize .. by_ is similar to _group by_ (Aggregate information). Example: summarize avg(CounterValue) by Computer, ComputerName
* Use series_decompose_anomalies to find anomalities in the query result: [Exploring Anomalies with Log Analytics using KQL](https://techcommunity.microsoft.com/t5/core-infrastructure-and-security/exploring-anomalies-with-log-analytics-using-kql/ba-p/2252477)

[Return to Manage security operations](README.md)

[Return to Table of Contents](../README.md)